[
    {
        "ID": "cardinal-ranjith-clarifies-financial-support-to-easter-attack-victims-ready-to-provide-verification",
        "Title": "Cardinal Ranjith clarifies financial support to Easter attack victims; ready to provide verification",
        "Link": "https://www.adaderana.lk/news/100021/cardinal-ranjith-clarifies-financial-support-to-easter-attack-victims-ready-to-provide-verification",
        "Date": "| June 22, 2024  12:06 pm",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1719038195-cardinal-1.jpg",
        "short_paragraph": "The Archbishop of Colombo Cardinal Malcolm Ranjith states that he has all the documents on how the funds received for victims of Easter Sunday terror attack was spent. MORE..",
        "Paragraph": "The Archbishop of Colombo Cardinal Malcolm Ranjith states that he has all the documents on how the funds received for victims of Easter Sunday terror attack was spent.\nResponding to the allegations levelled by former President Maithripala Sirisena, Cardinal Ranjith emphasized that the statement made by the former President regarding the relevant funds is completely baseless.\n“The statement made by former President Sirisena is completely hateful and inappropriate. He has a duty to ask the concerned parties what happened before making such remarks”, Cardinal Ranjith said.\n“Following the Easter attacks, we requested assistance from both international and domestic parties to address the needs of the affected individuals. These requirements were varied, including medical treatment in private hospitals for specialized care, and educational support for orphaned children. They required assistance from us in different areas.”\n“I cannot just tell the exact amount…around Rs 500 million that we collected…but we have the data for verification. We prepare and maintain audited reports from bank accounts. Of the Rs. 500 million, approximately Rs. 460 million have been distributed to those victims”, he added.\n“It is very unfortunate that if he [former President Sirisena] had inquired us before making such a statement, he could have obtained the necessary information. His comment appears to be made impulsively without analyzing the facts”, Cardinal Ranjith said further.\nMeanwhile, in response to a question raised by a Journalist, Cardinal Ranjith expressed: “We don’t know whether anyone has misled the former President. There is politics here. On the other hand, we know that his party is divided now. So, in this situation, he must be under mental stress. Therefore, we don’t have any issue with him making all these allegations, because our conscience is clear.”\nOn Thursday (20), former President Maithripala Sirisena alleged that Cardinal Malcolm Ranjith has not distributed any of the funds or financial aid received to assist the victims of the Easter Sunday terror attacks.\nSpeaking to the media in Polonnaruwa, the former President also claimed that most of the court cases against him were filed under the influence of Cardinal Ranjith.\nCommenting further, Sirisena said: “What happened to the funds received by the Cardinal from Catholic organisations, other countries of the world, top Sri Lankan businessmen and several other parties following the Easter attacks?… It is good if the Cardinal submits a list of individuals who received this money, and about what happened to this money. Not a single cent of those funds has been given to the victims.”\n“Even though I paid money from the government when I was president, now I have been sued to pay compensation on my own. That is the situation right now”, he added."
    },
    {
        "ID": "three-people-killed-10-wounded-in-arkansas-supermarket-shooting",
        "Title": "Three people killed, 10 wounded in Arkansas supermarket shooting",
        "Link": "https://www.adaderana.lk/news/100020/three-people-killed-10-wounded-in-arkansas-supermarket-shooting",
        "Date": "| June 22, 2024  10:57 am",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1719034079-shoot-1.jpg",
        "short_paragraph": "A shooter opened fire at an Arkansas supermarket on Friday, killing three civilians and wounding 10 other people, including two police officers, Arkansas State Police said. MORE..",
        "Paragraph": "A shooter opened fire at an Arkansas supermarket on Friday, killing three civilians and wounding 10 other people, including two police officers, Arkansas State Police said.\nThe suspect was also wounded in a shootout with police, Arkansas State Police Director Mike Hagar told reporters.\nThe shooting occurred at the Mad Butcher grocery in Fordyce, a town of 3,200 people about 70 miles (112 km) south of Little Rock.\n“Unfortunately, we can confirm that 11 innocent civilians were shot, and three of those are deceased. Two law enforcement officers were injured in the exchange of gunfire. The suspect was also shot and taken into custody,” Hagar said. He did not explain the circumstances of the shooting or take questions.\nThe wounded police officers and the suspect were expected to survive, he said.\nCivilian injuries ranged from non-life-threatening to extremely critical, he said.\nGovernor Sarah Huckabee Sanders said on social media platform X that she was briefed on the incident.\n“I am thankful to law enforcement and first responders for their quick and heroic action to save lives. My prayers are with the victims and all those impacted by this horrific incident,” she said.\nSource: Reuters\n--Agencies"
    },
    {
        "ID": "advisory-issued-for-strong-winds-and-rough-seas",
        "Title": "Advisory issued for strong winds and rough seas",
        "Link": "https://www.adaderana.lk/news/100019/advisory-issued-for-strong-winds-and-rough-seas",
        "Date": "| June 22, 2024  10:54 am",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1719033892-rough-sea-1.jpg",
        "short_paragraph": "The Department of Meteorology has issued an Amber advisory for strong winds and rough seas for the sea areas off the coasts extending from Mannar to Chilaw via Puttalam and from Hambantota to Pottuvil. MORE..",
        "Paragraph": "The Department of Meteorology has issued an ‘Amber’ advisory for strong winds and rough seas for the sea areas off the coasts extending from Mannar to Chilaw via Puttalam and from Hambantota to Pottuvil.\nThe advisory is in effect for the period until 06.00 a.m. on Sunday (23 June).\nAccordingly, the Met. Department warned that the sea areas off the coasts extending from Mannar to Chilaw via Puttalam and from Hambantota to Pottuvil will be very rough at times with very strong gusty winds up to 60- 65 kmph.\nThe sea areas off the coasts extending from Chilaw to Hambantota via Colombo and Galle and from Trincomalee to Mannar via Mullaitivu and Kankasanthurai will be rough at times with strong gusty winds up to 50-55 kmph, it added.\nWave heights may increase about 2.0–2.5 m in the sea areas off the coast extending from Kalpitiya to Pottuvil via Colombo, Galle, and Hambantota, the department said.\nThus, naval and fishing communities are requested to be attentive in this regard."
    },
    {
        "ID": "deadline-for-nic-applications-extended",
        "Title": "Deadline for NIC applications extended",
        "Link": "https://www.adaderana.lk/news/100018/deadline-for-nic-applications-extended",
        "Date": "| June 22, 2024  10:41 am",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1719033105-id-1.jpg",
        "short_paragraph": "The Department for Registration of Persons (DRP) has announced an extension for individuals over the age of 40 who have been unable to obtain National Identity Cards (NIC) due to issues with their birth certificates. MORE..",
        "Paragraph": "The Department for Registration of Persons (DRP) has announced an extension for individuals over the age of 40 who have been unable to obtain National Identity Cards (NIC) due to issues with their birth certificates.\nCommissioner General of the department Pradeep Saputhanthri stated that the deadline for these applications has been extended to June 30. Originally, the deadline was set for March 31.\nThis extension was granted in response to requests from Divisional Secretaries, according to the department."
    },
    {
        "ID": "president-inaugurates-new-district-secretariat-in-thiraimadu",
        "Title": "President inaugurates new District Secretariat in Thiraimadu",
        "Link": "https://www.adaderana.lk/news/100017/president-inaugurates-new-district-secretariat-in-thiraimadu",
        "Date": "| June 22, 2024  10:33 am",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1719032619-pres-1.jpg",
        "short_paragraph": "President Ranil Wickremesinghe has inaugurated the new District Secretariat in Thiraimadu, Batticaloa, a short while ago, the Presidents Media Division (PMD) said. MORE..",
        "Paragraph": "President Ranil Wickremesinghe has inaugurated the new District Secretariat in Thiraimadu, Batticaloa, a short while ago, the President’s Media Division (PMD) said.\nThe new District Secretariat building was built at a cost of Rs. 1,055 million, according to the PMD."
    },
    {
        "ID": "medical-brain-drain-worsens-in-sri-lanka-as-25-of-doctors-ready-to-migrate-report",
        "Title": "Medical brain drain worsens in Sri Lanka as 25% of doctors ready to migrate - report",
        "Link": "https://www.adaderana.lk/news/100016/medical-brain-drain-worsens-in-sri-lanka-as-25-of-doctors-ready-to-migrate-report",
        "Date": "| June 22, 2024  9:24 am",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1719028456-doc-1.jpg",
        "short_paragraph": "The biggest trade union of government doctors in Sri Lanka warned on Friday about a wave of economic crisis-driven brain drain among medical professionals, as 25 percent of them have already taken the necessary exams to find employment abroad. MORE..",
        "Paragraph": "The biggest trade union of government doctors in Sri Lanka warned on Friday about a wave of economic crisis-driven brain drain among medical professionals, as 25 percent of them have already taken the necessary exams to find employment abroad.\nBefore the worst economic crisis pummeled Sri Lanka in the wake of the COVID-19 pandemic in 2021, on average 200 doctors would migrate to work in another country, according to Ministry of Health statistics.\nThe number has surged since early 2022, when the country defaulted on its foreign debt. Sri Lankans started experiencing power cuts and shortages of basics such as fuel, food and medicine, and the inflation rate rose to 50 percent a year.\n“If we consider the situation within the last two years, more than 1,800 doctors have left the country in 2022 and 2023,” Dr. Chamil Wijesinghe, spokesperson of the Government Medical Officers Association, told Arab News.\nMany more are likely to follow in their footsteps as GMOA data shows that at least 25 percent of doctors currently serving in the government health system have already passed the necessary exams to find employment abroad.\nTo practice medicine in the UAE or Oman, doctors need to take the Prometric Exam for GP Doctor. To work in the UK, they are required to complete the Professional and Linguistic Assessments Board’s exams, while in Australia they have to follow the examination of the Australian Medical Council.\n“Considering only those three … recent statistics show that nearly 5,000 Sri Lankan doctors have completed these exams and they’re waiting to take their decision of leaving the country,” Wijesinghe said.\n“In government health institutions of Sri Lanka … there are around 20,000 doctors.”\nHe warned that an increasing number of those leaving were specialists, mainly in emergency medicine and anesthesia, followed by pediatricians, psychiatrists, neurologists and cardiac surgeons.\nSome of the world’s most rigorously trained, Sri Lankan doctors are required by their country’s health system to obtain both local and international training before they practice as consultants. At the same time, and compared with the years of experience, they are among the most underpaid, earning between $170 and $720 per month.\nIn the past two years, those who had left for compulsory training in countries such as the UK, Australia or the US, are not willing to return.\n“The high salaries they are being paid in those countries, compared to Sri Lanka, is the main reason. If you consider Middle East countries, it is nearly tenfold of the salary they are getting in Sri Lanka. In the UK and Australia, around 20 to 30-fold,” Wijesinghe said, adding that they are attracted by better working environments, better living standards, and education opportunities for their children.\n“Majority of the Sri Lankan doctors migrate to Australia and the United Kingdom … They are migrating with their family members as well.”\nHe estimated that nearly 400 specialists have left in the past two years, which was becoming a “huge problem” for the Sri Lankan health sector.\n“It has affected from the biggest hospital in Sri Lanka, the National Hospital of Sri Lanka, which is situated in Colombo, to the rural hospital system … Patients have to travel hundreds of kilometers sometimes to get their surgeries done,” he said.\n“The brain drain of professionals and intellectuals from this country has affected many sectors, but it’s a well-known fact that health is the most affected sector.”\nThe GMOA has proposed to the Sri Lankan government ways to mitigate the brain drain of doctors, but as the solutions involve financial incentives and restructuring of the salary system, the Ministry of Health does not expect it to happen immediately.\n“Increasing the salary is really difficult at this time since the country is just recovering from the economic crisis,” Dr. Asela Gunawardena, the ministry’s director-general of health services, told Arab News.\n“However, we will do our best to attend to their needs to attract them to come back to their country and work for the nation.”\nHe was also hopeful that a sense of duty would help bring them home as well.\n“Sri Lanka is the country which gave them free education from the kindergarten to university,” he said. “They have an obligation to help the country when in trouble.”\nSource: Arab News\n--Agencies"
    },
    {
        "ID": "heavy-showers-above-100mm-expected-in-parts-of-the-island",
        "Title": "Heavy showers above 100mm expected in parts of the island",
        "Link": "https://www.adaderana.lk/news/100015/heavy-showers-above-100mm-expected-in-parts-of-the-island",
        "Date": "| June 22, 2024  8:44 am",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1719026493-rain-1.jpg",
        "short_paragraph": "The Meteorology Department says showers will occur at times in Western, Sabaragamuwa and North-western provinces and in Kandy, Nuwara Eliya, Galle and Matara districts. MORE..",
        "Paragraph": "The Meteorology Department says showers will occur at times in Western, Sabaragamuwa and North-western provinces and in Kandy, Nuwara Eliya, Galle and Matara districts.\nHeavy showers above 100mm are likely at some places in Western and Sabaragamuwa provincesand in Kandy, Nuwara Eliya and Puttalam districts.\nSeveral spells of light showers will occur in Matale and Anuradhapura districts, it said.\nStrong winds of about 40-50kmph can be expected at times over the Western slopes of the central hills, Northern, North-central and North-western provincesand in Trincomalee, Hambantota and Monaragala districts."
    },
    {
        "ID": "two-from-sri-lanka-arrested-trying-to-illegally-enter-india",
        "Title": "Two from Sri Lanka arrested trying to illegally enter India",
        "Link": "https://www.adaderana.lk/news/100014/two-from-sri-lanka-arrested-trying-to-illegally-enter-india",
        "Date": "| June 21, 2024  10:55 pm",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718990925-arrested-0.jpg",
        "short_paragraph": "Indias Marine Police on Friday detained two Sri Lankans who had allegedly sneaked into Indian waters in a fibre boat. They were taken into custody for interrogation, Indian media reported.  MORE..",
        "Paragraph": "India’s Marine Police on Friday detained two Sri Lankans who had allegedly sneaked into Indian waters in a fibre boat. They were taken into custody for interrogation, Indian media reported.\nThe Hindu, quoting sources in the police department, reported that the two identified themselves as Julius (23) and Jude Antony (32) and claimed to be from Sri Lanka.\nThey spoke in Tamil and said that they hailed from Kalpitiya in Sri Lanka. Central agencies were also interrogating independently the two suspects, it said.\nThe fibre boat was thoroughly searched upon and a police officer said that the surveillance duty personnel spotted the boat approaching towards Mandapam and intercepted them.\nFurther interrogation was on.\n--Agencies"
    },
    {
        "ID": "negotiations-underway-with-china-to-finalize-arrangements-on-debt-repayment-president",
        "Title": "Negotiations underway with China to finalize arrangements on debt repayment  President",
        "Link": "https://www.adaderana.lk/news/100013/negotiations-underway-with-china-to-finalize-arrangements-on-debt-repayment-president",
        "Date": "| June 21, 2024  10:42 pm",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718991044-AIPPOA-president-ranil-0.jpg",
        "short_paragraph": "President Ranil Wickremesinghe emphasized the imperative of not forgetting the hardships endured in the past due to shortages of essential resources such as medicines, fuel and fertilizers critical for the country.  MORE..",
        "Paragraph": "President Ranil Wickremesinghe emphasized the imperative of not forgetting the hardships endured in the past due to shortages of essential resources such as medicines, fuel and fertilizers critical for the country.\nHe called upon all citizens to unite behind the government’s initiative aimed at fostering a new economic transformation in Sri Lanka, ensuring that future generations do not have to face similar challenges.\nHe stated that the government concluded the second round of discussions with the IMF Board of Directors last week received confirmation that the program guiding Sri Lanka is on the right track.\n“Consequently, we have been granted an extension to repay our debts. Currently, negotiations are underway with China to finalize these arrangements.”\nAdditionally, discussions are on-going with both Paris Club and non-Paris Club member countries, as well as with official creditors’ committees, to reach agreements, he said.\nWickremesinghe said this marks a significant step towards lifting the country out of the crisis it has faced. “However, our journey does not end here. It is imperative that we reflect on the reasons behind our economic challenges.”\nThe President highlighted this during his address at the 9th General Assembly of the All-Island Private Pharmacy Owners’ Association (AIPPOA), which took place on Friday (20).\nThe President also extended his appreciation to the All-Island Private Pharmacy Owners’ Association for their steadfastness during the past COVID-19 pandemic and economic crisis, fulfilling their responsibilities to the country.\nPresident Wickremesinghe further remarked:\n“I would like to extend my sincere gratitude on behalf of the Government to the All-Island Private Pharmacy Owners’ Association for supplying essential medicines during the recent COVID-19 pandemic. Your proactive response and commitment were crucial during a challenging period when governmental systems faced significant strain.\nFurthermore, as per the communication from your association, we are actively engaging to address arising issues and implement necessary actions. It is undeniable that many lives in our country have been preserved due to your dedication. In the past, there were financial constraints hindering access to essential medicines nationwide, yet you remained steadfast. Your unwavering commitment exemplifies the responsibility we expect from every citizen of our nation, a trait unfortunately not always prevalent.\nNeither you nor I are unfamiliar with these challenges, but we are collectively dedicated to rebuilding our country to the best of our abilities.\nWhen I assumed leadership of this country, we faced dire circumstances. Foreign exchange was scarce, and funds for essential medicines and fuel were lacking. We were confronted with tough choices, deciding whether to allocate funds for fuel or fertilizers. Opting for fertilizers, we revived agricultural activities, boosting production and ensuring access to medicines and fuel for our people. It was a challenging period, but crucial support from the Indian and Bangladeshi governments enabled us to import medicines and essential food items, sustaining us through the initial difficult 06 months. Subsequently, the nation began to progress steadily.\nDuring this time, there were heart-wrenching moments when people sought medicines without means to pay. You have faced the agonizing choice of denying them medication or providing aid amidst scarcity. These decisions were agonizing, but collectively, they propelled our country forward. Implementing necessary measures, including VAT adjustments, bolstered our revenue streams, strengthened the rupee, and facilitated economic progress. Today, we are advancing as a nation due to the resilience shown during these trying times.\nLast week, we concluded the second round of discussions with the IMF Board of Directors. We received confirmation that the program guiding Sri Lanka is on the right track. Consequently, we have been granted an extension to repay our debts. Currently, negotiations are underway with China to finalize these arrangements. Additionally, discussions are on-going with both Paris Club and non-Paris Club member countries, as well as with official creditors’ committees, to reach agreements.\nThis marks a significant step towards lifting the country out of the crisis it has faced. However, our journey does not end here. It is imperative that we reflect on the reasons behind our economic challenges.\nHistorically, Sri Lanka has not cultivated a robust export industry despite numerous opportunities. In 1979, during my visit to China, the country was economically less developed than Sri Lanka. Today, China supports us financially. Similarly, in 1991, as Minister of Industry, I met with Vietnam’s Industry Minister, who sought advice on attracting investments, earning foreign exchange, and establishing economic zones. Now, if I were to visit Vietnam, I would seek advice from them.\nWe have squandered many opportunities. If we fail to rectify this and transition to a new economic paradigm, we risk sliding back into economic turmoil. To prevent a return to those dark days, we have introduced a new economic program for the country.\nWe must depart from the old system and embrace a new paradigm. Our trajectory should mirror the progress achieved by nations like India and Bangladesh, fostering a competitive economy. Embracing cutting-edge technologies such as Artificial Intelligence (AI) is essential as we envision and build a revitalized nation.”\n--PMD"
    },
    {
        "ID": "sri-lanka-police-officers-in-india-for-specially-designed-training-course",
        "Title": "Sri Lanka Police officers in India for specially-designed training course",
        "Link": "https://www.adaderana.lk/news/100012/sri-lanka-police-officers-in-india-for-specially-designed-training-course",
        "Date": "| June 21, 2024  8:45 pm",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718983291-police-sri-lanka-india-0.jpg",
        "short_paragraph": "A batch of 23 senior Sri Lankan police officers are currently in New Delhi on a specially-designed two-week training course that started on June 18, the Indian High Commission in Colombo said on Friday. MORE..",
        "Paragraph": "A batch of 23 senior Sri Lankan police officers are currently in New Delhi on a specially-designed two-week training course that started on June 18, the Indian High Commission in Colombo said on Friday.\n“At the request of the Sri Lanka Police, the High Commission of India has been facilitating tailor-made capacity building training courses for the personnel of the Sri Lankan Police at the premier police training institutions viz. Central Detective Training Institute (CDTI), Jaipur; CDTI, Hyderabad; CDTI, Kolkata and National Security Guard (NSG), Manesar, in India,” the mission said in a press release.\n“India regularly offers fully-funded training slots to Sri Lankan Police personnel for various training courses to enhance the skills of the officers. Since the beginning of 2024, over 60 police personnel, including junior, mid-level and senior officers, have benefited from the high-quality training courses on various subjects such as crime scene management, artificial intelligence and cyber-crime investigation, and VIP security training,” the release added.\nThe courses are offered by the Government of India under the Indian Technical and Economic Cooperation (ITEC) and the “Aid to Sri Lanka” programme. More than 130 Sri Lankan police officers are expected to be trained in India this year.\nSource: PTI\n--Agencies"
    },
    {
        "ID": "govt-to-rebuild-or-compensate-houses-damaged-by-bad-weather-sagala",
        "Title": "Govt. to rebuild or compensate houses damaged by bad weather - Sagala",
        "Link": "https://www.adaderana.lk/news/100011/govt-to-rebuild-or-compensate-houses-damaged-by-bad-weather-sagala",
        "Date": "| June 21, 2024  7:14 pm",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718977460-sagala-ratnayake-1.jpg",
        "short_paragraph": "Senior Advisor to the President on National Security and Chief of Staff to the President Sagala Ratnayaka, announced that President Wickremesinghe has directed take the necessary measures to either rebuild or provide compensation, subject to a maximum limit, for houses that were completely damaged by recent adverse weather conditions. MORE..",
        "Paragraph": "Senior Advisor to the President on National Security and Chief of Staff to the President Sagala Ratnayaka, announced that President Ranil Wickremesinghe has directed take the necessary measures to either rebuild or provide compensation, subject to a maximum limit, for houses that were completely damaged by the recent adverse weather conditions.\nSagala Ratnayaka also stated that measures will be implemented to assess the damage and provide compensation, subject to a specified maximum limit, for the repair of partially damaged houses.\nRatnayaka shared these views during a discussion held at the Presidential Secretariat yesterday (20), concerning the rebuilding of houses fully and partially damaged by recent adverse weather conditions.\nThe discussion extensively covered the reconstruction of houses affected by natural calamities such as strong winds, floods and landslides, which have impacted various parts of the country in recent days. The provision of suitable compensation, subject to a maximum limit, was also deliberated.\nTo ensure appropriate compensation within specified limits, for fully damaged houses upon agreement with beneficiaries, and prompt construction of such houses with the assistance of the Armed Forces. Additionally, the assessment and repair of partially damaged houses, with compensation also subject to a specified maximum limit, were discussed.\nSagala Ratnayaka also directed District Secretaries to submit formal reports on houses fully and partially damaged by natural calamities.\nIn attendance at the discussion were State Minister of Defence Pramitha Bandara Tennakoon, the three commanders of the armed forces, and heads of relevant line Institutions. Participating remotely were District Secretaries and Divisional Secretaries via online technology.\n--PMD--"
    },
    {
        "ID": "major-power-cut-hits-bosnia-albania-montenegro-and-croatias-coast",
        "Title": "Major power cut hits Bosnia, Albania, Montenegro and Croatias coast",
        "Link": "https://www.adaderana.lk/news/100010/major-power-cut-hits-bosnia-albania-montenegro-and-croatias-coast",
        "Date": "| June 21, 2024  6:43 pm",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718975626-bosnia-power-cut-1.jpg",
        "short_paragraph": "A major power blackout hit Montenegro, Bosnia, Albania and most of Croatias Adriatic coast on Friday, officials said, disrupting businesses, shutting down traffic lights and leaving people sweltering in the middle of a heatwave. MORE..",
        "Paragraph": "A major power blackout hit Montenegro, Bosnia, Albania and most of Croatia’s Adriatic coast on Friday, officials said, disrupting businesses, shutting down traffic lights and leaving people sweltering in the middle of a heatwave.\nPower operators in the four countries said they were investigating what caused the failure. Albania’s Top Channel TV cited unnamed sources saying an interconnector had failed in Montenegro, though there was no official confirmation.\nIn Bosnia, there was no power in the capital Sarajevo and the cities of Banja Luka and Mostar, Reuters reporters said. Local media reported a blackout across the country.\nTraffic ground to a halt in the Croatian coastal city of Split after traffic lights failed, state TV HRT reported. Ambulance sirens rang out cross the city, it added.\nCroatia’s HEP power utility said that the outage in parts of the country had been caused by “an international disturbance that affected several countries,” without going into further detail.\n“The Croatian transmission system operator is conducting an analysis with the system operators of neighbouring countries to determine the cause,” HEP added.\nThe utility said it had put its production capacities into full operation to ensure “supply in the shortest possible time”.\nMontenegro power distributor CEDIS said “network outages” had cut power over most of the country.\nIvan Asanovic, the executive director of Montenegro’s CGES power utility, said the cause of the blackout “of regional magnitude” was unknown and that CGES and CEDIS were working together to resolve it.\nAlbania’s Top Channel said the capital Tirana and a number of towns had no electricity.\nSource: Reuters\n--Agencies"
    },
    {
        "ID": "sri-lanka-women-dominate-west-indies-with-clean-sweep",
        "Title": "Sri Lanka Women dominate West Indies with clean sweep",
        "Link": "https://www.adaderana.lk/news/100009/sri-lanka-women-dominate-west-indies-with-clean-sweep",
        "Date": "| June 21, 2024  5:13 pm",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718970224-sl-women-1.jpg",
        "short_paragraph": "In a stellar display of dominance, the Sri Lanka womens cricket team completed a clean sweep of the ODI series against the West Indies, clinching a decisive 3-0 victory as they won the third and the final match by 160 runs. MORE..",
        "Paragraph": "In a stellar display of dominance, the Sri Lanka women’s cricket team completed a clean sweep of the ODI series against the West Indies, clinching a decisive 3-0 victory as they won the third and the final match by 160 runs.\nThe triumphant final match, held today (21) at the Mahinda Rajapaksa International Cricket Stadium, Hambantota, sealing their supremacy in the series and marking a historic high point for the team.\nBatting first, Sri Lanka scored a record 275 total at the end of 50 overs, for the fall of 6 wickets. Veteran Chamari Athapaththu delivered an impressive knock of 91 runs, in partnership with Nilakshi de Silva’s 63. Anushka Sanjeewani hit 55 in 46 deliveries.\nChasing the formidable target of 275 Sri Lankan women, Chedean Nation of West Indies hit 46, while Aaliyah Alleyne smashed 27. However, the West Indies were all out for 115 at the end of 34.5 overs.\nSri Lanka’s Sachini Nisansala claimed 5 wickets while Oshadi Ranasinghe picked up 2 wickets to help strengthen Sri Lanka’s bowling attack.\nSri Lanka Women record an ODI series whitewash (3-0) against West Indies Women for the first time in 16 years."
    },
    {
        "ID": "maithripalas-attempting-to-mask-own-political-bankruptcy-catholic-church-responds-to-ex-president",
        "Title": "Maithripalas attempting to mask own political bankruptcy Catholic Church responds to ex-President",
        "Link": "https://www.adaderana.lk/news/100008/maithripalas-attempting-to-mask-own-political-bankruptcy-catholic-church-responds-to-ex-president",
        "Date": "| June 21, 2024  3:00 pm",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718962200-political-1.jpg",
        "short_paragraph": "Responding to the allegations levelled by former President Maithripala Sirisena, a Spokesman for the Catholic Church on Friday said that the Archbishop of Colombo Cardinal Malcolm Ranjith has distributed over Rs. 500 million of financial aid received to assist the victims of the Easter Sunday attacks. MORE..",
        "Paragraph": "Responding to the allegations levelled by former President Maithripala Sirisena, a Spokesman for the Catholic Church on Friday said that the Archbishop of Colombo Cardinal Malcolm Ranjith has distributed over Rs. 500 million of financial aid received to assist the victims of the Easter Sunday attacks.\nNational Catholic Mass Communications Director, Rev. Fr. Jude Krishantha charged that the former President is making up such stories in front of the media in order to cover up his own ‘political bankruptcy’.\n“Mr. Maithripala Sirisena is ‘politically bankrupt’ as of today. So, he makes all these false statements in front of media to cover up his ‘political bankruptcy’”, he said.\n“In fact, His Eminence the Cardinal has distributed over Rs. 500 million for these victims [of the Easter attacks]…The ‘Seth Sarana Caritas’, a welfare organization maintained under Cardinal Ranjith has spent the funds for the victims.”\n“There is a teaching of Lord Jesus Christ that even your left hand should not know what your right hand is doing, so that what you are giving may be in secret. That is why the Catholic Church does not advertise the things we do on the media. That’s why we keep confidentiality in the things we give”, Rev. Fr. Jude Krishantha added.\nOn Thursday (20), former President Maithripala Sirisena alleged that Cardinal Malcolm Ranjith has not distributed any of the funds or financial aid received to assist the victims of the Easter Sunday terror attacks.\nSpeaking to the media in Polonnaruwa, the former President also claimed that most of the court cases against him were filed under the influence of Cardinal Ranjith.\nCommenting further, Sirisena said: “What happened to the funds received by the Cardinal from Catholic organisations, other countries of the world, top Sri Lankan businessmen and several other parties following the Easter attacks?… It is good if the Cardinal submits a list of individuals who received this money, and about what happened to this money. Not a single cent of those funds has been given to the victims.”\n“Even though I paid money from the government when I was president, now I have been sued to pay compensation on my own. That is the situation right now”, he added."
    },
    {
        "ID": "airport-security-officer-arrested-with-gold-biscuits-worth-rs-48-mn-at-bia",
        "Title": "Airport security officer arrested with gold biscuits worth Rs. 48 mn at BIA",
        "Link": "https://www.adaderana.lk/news/100007/airport-security-officer-arrested-with-gold-biscuits-worth-rs-48-mn-at-bia",
        "Date": "| June 21, 2024  2:01 pm",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718960056-gold-1.jpg",
        "short_paragraph": "The Narcotics Control Unit of Sri Lanka Customs has apprehended an officer of the airport security division while attempting to smuggle 18 gold biscuits worth around Rs. 48 million out of the Bandaranaike International Airport (BIA) in Katunayake. MORE..",
        "Paragraph": "The Narcotics Control Unit of Sri Lanka Customs has apprehended an officer of the airport security division while attempting to smuggle 18 gold biscuits worth around Rs. 48 million out of the Bandaranaike International Airport (BIA) in Katunayake.\nThe arrested airport security officer is a 40-year-old resident of Hakmana, Matara, who has been in service for around 15 years, Ada Derana reporter said.\nThe individual, who had just completed his night shift, was arrested with a stash of golden biscuits hidden in his trouser pockets. He has reportedly received the gold biscuits from a passenger inside the bathroom of the arrival terminal.\nThe suspect was apprehended as he was trying to leave the airport premises.\nInitial investigations conducted by Sri Lanka Customs have revealed that the arrested security officer had been promises a sum of Rs. 60,000 to get the gold biscuits out of the airport premises.\nA total of 18 gold biscuits of 24-carat gold, each weighing 116.6 grams and with a total weight of 2 kilograms and 86 grams, was confiscated from the suspect, according to Sri Lanka Customs.\nThe Narcotics Control Unit of Sri Lanka Customs is conducting further investigations in this regard."
    },
    {
        "ID": "289-prisoners-pardoned-for-poson-poya",
        "Title": "289 prisoners pardoned for Poson Poya",
        "Link": "https://www.adaderana.lk/news/100006/289-prisoners-pardoned-for-poson-poya",
        "Date": "| June 21, 2024  12:14 pm",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718952240-inmates-pardoned-1.jpg",
        "short_paragraph": "The Department of Prisons has released 289 inmates from prisons across the island today (June 21) under a special state pardon granted by President Ranil Wickremesinghe in view of Poson Poya Day. MORE..",
        "Paragraph": "The Department of Prisons has released 289 inmates from prisons across the island today (June 21) under a special state pardon granted by President Ranil Wickremesinghe in view of Poson Poya Day.\nPrisons Spokesman Gamini B. Dissanayake stated that accordingly, 263 male inmates and 06 female inmates serving time for minor offences were granted a state pardon, in accordance with Article 34 of the Constitution of Sri Lanka.\nAmong the pardoned prisoners were 19 detained in Welikada Prison, 30 in Mahara Prison, 30 in Wariyapola Prison and 28 inmates in Kalutara Prison, according to the Department of Prisons."
    },
    {
        "ID": "india-will-always-be-a-reliable-friend-and-dependable-partner-for-sri-lanka-jaishankar",
        "Title": "India will always be a reliable friend and dependable partner for Sri Lanka: Jaishankar",
        "Link": "https://www.adaderana.lk/news/100005/india-will-always-be-a-reliable-friend-and-dependable-partner-for-sri-lanka-jaishankar",
        "Date": "| June 21, 2024  11:11 am",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718949309-jai-1.jpg",
        "short_paragraph": "The Minister of External Affairs of India Dr. S. Jaishankar while concluding his official visit to Sri Lanka on Thursday (20) said that India will always be a reliable friend and a dependable partner for Sri Lanka. MORE..",
        "Paragraph": "The Minister of External Affairs of India Dr. S. Jaishankar while concluding his official visit to Sri Lanka on Thursday (20) said that India will always be a reliable friend and a ‘dependable partner’ for Sri Lanka.\nPosting on ‘X’, Dr. S. Jaishankar noted: “Concluded a productive visit to Sri Lanka, my first in this new term. We will always be a reliable friend and a dependable partner for our Sri Lankan friends.”\nThe Indian External Minister, who arrived on the island on Thursday morning, called on President Ranil Wickremesinghe and engaged in a one-on-one meeting.\nDuring this meeting three milestones in Indo-Sri Lanka relations were achieved as President Wickremesinghe and the visiting Indian External Affairs Minister jointly unveiled the virtual plaque for 106 houses in Kandy, Nuwara Eliya and Matale under the Indian Housing Project. Meanwhile, 24 houses in each model village in Colombo and Trincomalee were also handed over virtually.\nThe Indian Foreign Minister and the Sri Lankan President also unveiled the virtual plaque to mark the formal commissioning of the “Maritime Rescue Coordination Centre (MRCC)” in Sri Lanka under a USD 06 million grant from India.  This includes a centre at Navy Headquarters in Colombo, a sub-centre in Hambantota and unmanned installations at Galle, Arugambay, Batticaloa, Trincomalee, Kallarawa, Point Pedro and Mollikulam.\nDr. Jaishankar later called on Prime Minister Dinesh Gunawardena at Temple Trees in Colombo and assured that neighbours like Sri Lanka are extremely important to India and there is tremendous goodwill for Sri Lanka in India.\nHe said the Indian government reaffirms the ‘Neighbourhood First Policy’ and the main purpose of his visit is to underline India’s continued commitment to Sri Lanka as its closest maritime neighbour and time tested friend.\nThe Prime Minister and the Minister Jaishankar discussed Indian investments, development projects, connectivity projects and other mutually beneficial cooperation in different spheres.\nMoreover, the Indian Foreign Minister had also interacted with leadership of Indian Origin Tamils, Minister Jeevan Thondaman. The meeting was participated by A. Aravindh Kumar, M Rameshwaran, V.  Radhakrishnan, Velu Kumar, Udayakumar and Vadivel Suresh as well.\nTaking to ‘X’, Jaishankar stated that they discussed the development partnership between India and Sri Lanka, and further cooperation in respect of Indian Origin Tamils.\nAdditionally, the Indian Foreign Minister also met a group of opposition MPs including Leader of Opposition Sajith Premadasa, G.L .Peiris, Eran Wickremaratne, Niroshan Perera, Palini Thigambaram, Rauff Hakeem and V Radhakrishnan.\nBefore the conclusion of his official visit, Jaishankar had a discussion with his Sri Lankan counterpart Ali Sabry covering further prospects in capacity building and shared engagement.\n“Also exchanged perspectives of greater multilateral cooperation, especially in BIMSTEC, IORA and the UN”, Minister Jaishankar added."
    },
    {
        "ID": "hajj-death-toll-tops-1000-after-extreme-heat-report",
        "Title": "Hajj death toll tops 1,000 after extreme heat: report",
        "Link": "https://www.adaderana.lk/news/100004/hajj-death-toll-tops-1000-after-extreme-heat-report",
        "Date": "| June 21, 2024  10:57 am",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718947654-HAJJI-1.jpg",
        "short_paragraph": "The death toll from this years hajj has exceeded 1,000, an AFP tally said Thursday, more than half unregistered worshippers who performed the pilgrimage in extreme heat in Saudi Arabia. MORE..",
        "Paragraph": "The death toll from this year’s hajj has exceeded 1,000, an AFP tally said Thursday, more than half unregistered worshippers who performed the pilgrimage in extreme heat in Saudi Arabia.\nThe new deaths reported Thursday included 58 from Egypt, according to an Arab diplomat who provided a breakdown showing that of 658 Egyptians who died, 630 were unregistered pilgrims.\nAround 10 countries have reported 1,081 deaths during the pilgrimage, one of the five pillars of Islam which all Muslims with the means must complete at least once.\nThe hajj, whose timing is determined by the lunar Islamic calendar, fell again this year during the oven-like Saudi summer.\nThe national meteorological centre reported a high of 51.8 degrees Celsius (125 Fahrenheit) this week at the Grand Mosque in Mecca.\nA Saudi study published last month said temperatures in the area are rising 0.4 degrees Celsius each decade.\nEach year tens of thousands of pilgrims try to join the hajj through irregular channels as they cannot afford the often costly official permits.\nSaudi authorities reported clearing hundreds of thousands of unregistered pilgrims from Mecca this month, but it appears many still participated in the main rites which began last Friday.\nThis group was more vulnerable, because without official permits they could not access air-conditioned spaces provided for the 1.8 million authorised pilgrims to cool down.\n“People were tired after being chased by security forces before Arafat day. They were exhausted,” one Arab diplomat told AFP on Thursday of Saturday’s day-long outdoor prayers that marked the hajj’s climax.\nThe diplomat said the main cause of death among Egyptian pilgrims was the heat, which triggered complications related to high blood pressure and other issues.\nEgyptian officials were visiting hospitals to obtain information and help Egyptian pilgrims get medical care, the foreign ministry said in a statement on Thursday.\n“However, there are large numbers of Egyptian citizens who are not registered in hajj databases, which requires double the effort and a longer time to search for missing persons and find their relatives,” it said.\nEgyptian President Abdel Fattah El-Sisi has ordered that a “crisis cell” headed by the prime minister follow up on the deaths of the country’s pilgrims.\nSisi stressed “the need for immediate coordination with the Saudi authorities to facilitate receiving the bodies of the deceased and streamline the process,” said a statement from his office.\nBurials begin\nMore fatalities were also confirmed on Thursday by Pakistan and Indonesia.\nOut of around 150,000 pilgrims, Pakistan has so far recorded 58 deaths, a diplomat told AFP.\n“I think given the number of people, given the weather, this is just natural,” the diplomat said.\nIndonesia, which had around 240,000 pilgrims, raised its death toll to 183, its religious affairs ministry said, compared with 313 deaths recorded last year.\nDeaths have also been confirmed by Malaysia, India, Jordan, Iran, Senegal, Tunisia, Sudan and Iraq’s autonomous Kurdistan region. In many cases, authorities have not specified the cause.\nFriends and relatives have been searching for missing pilgrims, scouring hospitals and pleading online for news, fearing the worst.\nTwo diplomats told AFP Thursday that Saudi authorities had begun the burial process for dead pilgrims, cleaning the bodies and putting them in white burial cloth and taking them to be interred.\n“The burial is done by the Saudi authorities. They have their own system so we just follow that,” said one diplomat, who said his country was working to notify loved ones as best it could.\nThe other diplomat said that given the number of fatalities it would be impossible to notify many families ahead of time, especially in Egypt which accounts for so many of the dead.\nJordan’s foreign ministry said on Thursday that Saudi authorities had granted 68 permits for Jordanian pilgrims to be buried in Mecca.\nSixteen Jordanians remain missing and 22 are in hospital, including seven who are in critical condition, the foreign ministry said in a statement.\n‘Extreme danger’\nSaudi Arabia has not provided information on fatalities, though it reported more than 2,700 cases of “heat exhaustion” on Sunday alone.\nLast year various countries reported more than 300 deaths during the hajj, mostly Indonesians.\nThe timing of the hajj moves back about 11 days each year in the Gregorian calendar, meaning that next year it will take place earlier in June, potentially in cooler conditions.\nA 2019 study by the journal Geophysical Research Letters said because of climate change, heat stress for hajj pilgrims will exceed the “extreme danger threshold” from 2047 to 2052 and 2079 to 2086, “with increasing frequency and intensity as the century progresses”.\nHosting the hajj is a source of prestige for the Saudi royal family, and King Salman’s official title includes the words “Custodian of the Two Holy Mosques”, in Mecca and Medina.\nThe hajj has seen a number of disasters over the years, most recently in 2015 when a stampede during the “stoning the devil” ritual killed up to 2,300 people.\nSource: AFP\n--Agencies"
    },
    {
        "ID": "cope-uncovers-major-irregularities-in-ceylon-petroleum-corporation",
        "Title": "COPE uncovers major irregularities in Ceylon Petroleum Corporation",
        "Link": "https://www.adaderana.lk/news/100003/cope-uncovers-major-irregularities-in-ceylon-petroleum-corporation",
        "Date": "| June 21, 2024  9:56 am",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718943968-cope-1.jpg",
        "short_paragraph": "The Committee on Public Enterprises (COPE) has uncovered significant financial irregularities within the Ceylon Petroleum Corporation (CPC), resulting in a loss of Rs. 3,416 million from 2014 to 2022. MORE..",
        "Paragraph": "The Committee on Public Enterprises (COPE) has uncovered significant financial irregularities within the Ceylon Petroleum Corporation (CPC), resulting in a loss of Rs. 3,416 million from 2014 to 2022.\nThis was attributed to internal dishonesty and a delay of 8 years and 8 months in issuing critical circulars to filling station owners by the Corporation’s marketing department.\nCOPE has expressed strong displeasure and insisted on holding the responsible officials accountable.\nThe issue came to light during a recent COPE meeting chaired by MP Rohitha Abeygunawardena to review the Auditor General’s 2022 report and the current status of the corporation, the Communications Dept. Of Parliament said in a press release.\nThe Committee directed the Corporation to submit a detailed report within seven working days, listing the names of those involved in the fraud and the measures taken to address the issue.\nAdditionally, it was revealed that the public has had to bear an extra cost for fuel due to the payment of Rs. 31,021.07 million in excessive commissions to distributors.\nThe overpayments have resulted in consumers paying Rs. 5.85 more per liter for 92 petrol, Rs. 7.50 for 95 petrol, Rs. 5.88 for Lanka Energy Diesel (LED), and Rs. 6.96 for Lanka Super Diesel (LSD), it said.\nCOPE has called for a comprehensive report within two weeks on those responsible for the financial misconduct and recommended filing a complaint with the CID for further investigation. Some officials implicated in the fraud are reportedly no longer in the country, it was revealed."
    },
    {
        "ID": "mobile-initiative-to-streamline-urumaya-freehold-land-deed-distribution",
        "Title": "Mobile initiative to streamline Urumaya freehold land deed distribution",
        "Link": "https://www.adaderana.lk/news/100002/mobile-initiative-to-streamline-urumaya-freehold-land-deed-distribution",
        "Date": "| June 21, 2024  8:58 am",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718940502-pmd-1.jpg",
        "short_paragraph": "The Urumaya National Operations Secretariat has organized a mobile initiative across the country from the 26th to the 30th of this month in order to expedite the Urumaya national program, which aims to provide 02 million freehold land deeds. MORE..",
        "Paragraph": "The Urumaya National Operations Secretariat has organized a mobile initiative across the country from the 26th to the 30th of this month in order to expedite the “Urumaya” national program, which aims to provide 02 million freehold land deeds.\nSenior Additional Secretary to the President, Mrs. Chandra Herath, stated that government officials responsible for issuing freehold deeds will visit villages to gather information from residents and expedite the issuance of the freehold deeds.\nSenior Additional Secretary, Mrs. Chandra Herath, shared these views during a press conference held Thursday (20) at the Presidential Media Centre.\nShe further elaborated:\n“Large numbers of land deeds have been distributed around the country under the “Urumaya” freehold land deeds program. This initiative is actively on-going across the country, with plans to accelerate its progress through a mobile service. The mobile program is scheduled to be implemented island wide from 26th to 30th of this month.\nAll government officials responsible for issuing freehold land deeds will participate in this mobile program. Licensees simply need to present their licenses or offer sheets. All necessary measurements and documentation will be handled by government officials. The Registrar General’s Department, Survey Department, Divisional Secretariats, and District Secretariats are involved in this program. Additionally, it should be mentioned that no fees will be charged to land license holders for this service”.\nSecretary to the Ministry of Irrigation, Saman Darshana Padikorala;\n“There are over 280,000 licensees within the Mahaweli Zones. The Urumaya program aims to provide freehold land deeds to all licensees residing in fifteen districts across the ten Mahaweli zones. Currently, preparations are underway to issue deeds to approximately 60, 000 people”.\nCommissioner General of Land, Bandula Jayasinghe;\n“The “Urumaya” Freehold Land Deeds program has made significant progress so far. However, many rural residents have not fully understood its benefits. Some individuals keep their landowner’s licenses at home, missing the valuable opportunity to obtain a freehold deed.\nTherefore, it is now advised that license holders promptly meet with their Divisional Secretary to submit their licenses and apply for a freehold land deed without any conditions.\nAdditionally, to enhance the efficiency of these activities, the Presidential Secretariat, Land Commissioner General’s Department, Mahaweli Authority, Survey Department, and Registrar General’s Department have jointly organized this mobile service to cover every divisional secretariat and Grama Niladhari Division.\nTo facilitate this, officials including the Divisional Secretary will visit the villages. The public are required to submit the documents pertaining to your land and receive a receipt. People are urged to secure their freehold land rights promptly under the Urumaya program”.\n\nSource: PMD"
    },
    {
        "ID": "china-to-keep-supporting-sri-lanka-on-debt-sustainability-spokesman",
        "Title": "China to keep supporting Sri Lanka on debt sustainability - spokesman",
        "Link": "https://www.adaderana.lk/news/100001/china-to-keep-supporting-sri-lanka-on-debt-sustainability-spokesman",
        "Date": "| June 21, 2024  8:31 am",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718939235-china-1.jpg",
        "short_paragraph": "China will keep supporting Sri Lanka to achieve debt sustainability as it has always been doing to help the countrys socioeconomic development, said a Chinese Foreign Ministry spokesman in Beijing. MORE..",
        "Paragraph": "China will keep supporting Sri Lanka to achieve debt sustainability as it has always been doing to help the country’s socioeconomic development, said a Chinese Foreign Ministry spokesman in Beijing.\nLin Jian, the spokesman, made the remarks at a regular press conference in response to a media question about the recent diplomatic consultations between China and Sri Lanka in the Chinese capital.\n“On the 13th round of China-Sri Lanka diplomatic consultations, China has released a readout, which you may refer to. What I can tell you is that the Chinese side has been providing assistance to Sri Lanka’s socioeconomic development to the best of our capability.”\n“We stand ready to continue to work with relevant countries and international financial institutions to support Sri Lanka’s debt sustainability,” he said.\n--Agencies"
    },
    {
        "ID": "fairly-heavy-showers-expected-in-parts-of-the-country",
        "Title": "Fairly heavy showers expected in parts of the country",
        "Link": "https://www.adaderana.lk/news/100000/fairly-heavy-showers-expected-in-parts-of-the-country",
        "Date": "| June 21, 2024  8:20 am",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718938252-rains-to-enhance-0.jpg",
        "short_paragraph": "The Meteorology Department says showers will occur at times in Western, Sabaragamuwa and North-western provinces and in Kandy, Nuwara Eliya, Galle and Matara districts.  MORE..",
        "Paragraph": "The Meteorology Department says showers will occur at times in Western, Sabaragamuwa and North-western provinces and in Kandy, Nuwara Eliya, Galle and Matara districts.\nFairly heavy showers above 75 mm are likely at some places in Western and Sabaragamuwa provinces and in Nuwara-Eliya, Galle and Matara districts.\nShowers or thundershowers may occur at a few places in Uva province and in Ampara and Batticaloa districts in the evening or night, it said.\nStrong winds of about 40-50 kmph can be expected at times over the Western slopes of the central hills, Northern, North-central and North-western provinces and in Trincomalee, Hambantota and Monaragala districts."
    },
    {
        "ID": "india-and-sri-lanka-discuss-initiatives-to-enhance-energy-connectivity",
        "Title": "India and Sri Lanka discuss initiatives to enhance energy connectivity",
        "Link": "https://www.adaderana.lk/news/99999/india-and-sri-lanka-discuss-initiatives-to-enhance-energy-connectivity",
        "Date": "| June 20, 2024  10:23 pm",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718902396-pres-1.jpg",
        "short_paragraph": "In a significant diplomatic exchange, President Ranil Wickremesinghe and Indian External Affairs Minister Dr. S. Jaishankar led bilateral discussions at the Presidents House today (20). The joint energy projects between India and Sri Lanka took centre stage during these discussions. MORE..",
        "Paragraph": "In a significant diplomatic exchange, President Ranil Wickremesinghe and Indian External Affairs Minister Dr. S. Jaishankar led bilateral discussions at the President’s House today (20). The joint energy projects between India and Sri Lanka took centre stage during these discussions.\r\n \r\nFollowing the official meeting between President Ranil Wickremesinghe and Indian External Affairs Minister Dr. S. Jaishankar, they delved into various initiatives aimed at enhancing energy connectivity and developing the renewable energy sector.\r\n \r\nSignificant attention was given to plans for an LNG supply, a proposed petroleum pipeline linking the two countries, and advancing oil and gas exploration projects. Additionally, it was announced that construction of the Sampur Solar Power Plant is set to commence in July 2024.\r\n \r\nAdditionally, plans were unveiled for the Sampur Solar Power Plant to commence construction in July 2024.\r\n \r\nDiscussions also centred on enhancing the efficiency of projects supported by the Indian government aimed at bolstering Sri Lanka’s liquid milk industry and fertilizer production.\r\n \r\nFurthermore, talks covered projects under India’s support for developing Trincomalee and expanding the Kankasanthurai port.\r\n \r\nThe meeting also addressed the ongoing development of Jaffna Airport and Colombo Airport with Indian assistance, as well as the acceleration of Sri Lanka’s unique digital identity card project, marking a significant step towards the country’s digitization efforts.\r\n \r\nMinister of Foreign Affairs Ali Sabry, Minister of Ports, Shipping, and Aviation Nimal Siripala de Silva, Minister of Agriculture and Plantation Industries Mahinda Amaraweera, Minister of Power and Energy Kanchana Wijesekera, Senior Adviser on National Security and Head of Presidential Staff Sagala Ratnayaka, Secretary to the President Saman Ekanayake, along with an Indian delegation including Indian High Commissioner to Sri Lanka Santosh Jha, were also present at the event.\n"
    },
    {
        "ID": "at-least-36-die-in-india-after-drinking-tainted-liquor",
        "Title": "At least 36 die in India after drinking tainted liquor",
        "Link": "https://www.adaderana.lk/news/99998/at-least-36-die-in-india-after-drinking-tainted-liquor",
        "Date": "| June 20, 2024  10:16 pm",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718902004-india-1.jpg",
        "short_paragraph": "At least 36 people died and more than 60 were being treated in hospitals after consuming tainted liquor in the southern Indian state of Tamil Nadu, a government spokesperson said on Thursday. MORE..",
        "Paragraph": "At least 36 people died and more than 60 were being treated in hospitals after consuming tainted liquor in the southern Indian state of Tamil Nadu, a government spokesperson said on Thursday.\nSince Wednesday over 100 people, suffering from vomiting, stomach ache and diarrhoea, have needed hospital treatment in the Kallakurichi district, 250 km (150 miles) by road from the state capital Chennai, the spokesperson said.\nThe state government said it had taken disciplinary action against at least 10 officials, including the district’s chief administrator and its police chief.\n“I was shocked and saddened to hear the news ... Action has also been taken against the officials who failed to prevent it,” Tamil Nadu Chief Minister M.K. Stalin said in a post on X.\nPolice arrested four people over the sale of illicit liquor and seized 200 litres of the methanol-mixed alcoholic drink, the state government said.\nDeaths from illegally produced alcohol, known locally as “hooch” or “country liquor”, are a regular occurrence in India, where many cannot afford branded spirits.\nThe Tamil Nadu government said it was also taking steps to identify people involved in the production of methanol - a toxic chemical normally used for industrial purposes.\nA video from ANI, in which Reuters has a minority stake, showed healthcare officials carrying patients in ambulances into a hospital while another shot showed several people standing outside a mortuary in Kallakurichi.\nMore than a dozen people died last year in a similar incident in a nearby district of Tamil Nadu.\nSource: Reuters\n--Agencies"
    },
    {
        "ID": "maithripala-accuses-cardinal-ranjith-over-funds-received-to-support-easter-attack-victims",
        "Title": "Maithripala accuses Cardinal Ranjith over funds received to support Easter attack victims",
        "Link": "https://www.adaderana.lk/news/99997/maithripala-accuses-cardinal-ranjith-over-funds-received-to-support-easter-attack-victims",
        "Date": "| June 20, 2024  7:34 pm",
        "Image": "https://adaderanaenglish.s3.amazonaws.com/1718892243-Maithripala-Sirisena-1.jpg",
        "short_paragraph": "Former President Maithripala Sirisena alleges that the Archbishop of Colombo Cardinal Malcolm Ranjith has not distributed any of the funds or financial aid received to assist the victims of the Easter Sunday terror attacks. MORE..",
        "Paragraph": "Former President Maithripala Sirisena alleges that the Archbishop of Colombo Cardinal Malcolm Ranjith has not distributed any of the funds or financial aid received to assist the victims of the Easter Sunday terror attacks.\nSpeaking to the media in Polonnaruwa today (20), the former President claimed that most of the court cases against him were filed under the influence of Cardinal Ranjith.\n“I have set a Guinness World Record with over four hundred court cases against me. These cases were filed as instructed by the Cardinal…one case for the deceased, another for the injured…asking to pay compensation”, Sirisena charged.\n“During my tenure as the President, I clearly compensated each and every one.”\n“What happened to the funds received by the Cardinal from Catholic organisations, other countries of the world, top Sri Lankan businessmen and several other parties following the Easter attacks?… It is good if the Cardinal submits a list of individuals who received this money, and about what happened to this money. Not a single cent of those funds has been given to the victims.”\n“Even though I paid money from the government when I was president, now I have been sued to pay compensation on my own. That is the situation right now”, he added.\n"
    }
]